In [1]:
import pandas as pd
import numpy as np

In [25]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [26]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [27]:
flight_number = np.arange(10045,10086,10)
df['FlightNumber'] = flight_number

In [28]:
print('the datatype for FlightName col is {}'.format(df['FlightNumber'].dtypes))

df

the datatype for FlightName col is int32

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [29]:
#temo will be an array having 5 rows and two col (shape = 5,2)
temp = np.array([x.split('_') for x in list(df['From_To'])])

(5, 2)

In [30]:
#temp df with two col 
temp_df = pd.DataFrame({'From': temp[:,0],'To': temp[:,1]})

In [8]:
temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [9]:
def capital(astr):
    return astr.capitalize()

In [10]:
temp_df['From'] = temp_df['From'].map(capital)
temp_df['To'] = temp_df['To'].map(capital)

In [11]:
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [12]:
df.drop('From_To',axis = 1,inplace = True)
df = pd.concat([temp_df,df],axis = 1)

In [13]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

## 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [14]:
#creating a matrix of size 5*3 (5 == no of rows, 3 == no of columns of delay)
temp_matrix = np.full(shape = (5,3),fill_value = np.nan)

In [15]:
temp_matrix

array([[nan, nan, nan],
       [nan, nan, nan],
       [nan, nan, nan],
       [nan, nan, nan],
       [nan, nan, nan]])

In [20]:
#mapping the values of delay into the temp_matrix
for i in range(5):
    length = len(df['RecentDelays'][i])
    temp_matrix[i][0:length] = df['RecentDelays'][i]

In [21]:
temp_matrix

array([[23., 47., nan],
       [nan, nan, nan],
       [24., 43., 87.],
       [13., nan, nan],
       [67., 32., nan]])

In [22]:
#making each separate row for the three valies in the list
for i in range(3):
    df['delay' + str(i+1)] = temp_matrix[:,i]

In [23]:
#we can see the columns delay_1,delay_2,and dlay_3
df

,From,To,FlightNumber,RecentDelays,Airline,delay1,delay2,delay3
0,London,Paris,10045,"[23, 47]",KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,[],<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,[13],12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"[67, 32]","""Swiss Air""",67.0,32.0,NaN